# coding=utf-8

from openpyxl import load_workbook
from openpyxl import Workbook
import random


class Config:
    base = "./file/1.xlsx"
    result = "./file/result2.xlsx"


class Result:
    field1 = ['厂房位置', '设备名称', '设备厂家', 'ID', 'DS', 'UD', 'ND', 'PT', 'RT', 'PN', 'AN', 'ED', 'KR',
              'SG', 'FQ', 'CP', 'HW', 'BP', 'LC', 'AP', 'AR', 'FL', 'ST', 'RS', 'EU', 'FM', 'IV', 'TV', 'BV', 'LL',
              'HL', 'ZL', 'ZH', 'DB', 'DT', 'KZ', 'KT', 'CT', 'EX', 'GN', 'TM', 'AV',"时间范围"]
    field2 = ['8464876', '-32768', '3420905774018240000', '8388611', '0', '0', '136_MNL_TAG169', '', '注塑供水_总电量', '',
              '0x', '0', '0', '23260918', '0', '0', '0', '1', '0', '', '', '', '0', '0', '100', '0', '0', '0', '0', '0',
              '0.2', '0', '0', '0', '2021/2/2  11:10:50', '', '690XD_SB.90A1_MASTER.136_MNL_TAG169']
    field3 = ['2020-06-01~2020-06-07', '2020-06-08~2020-06-14', '2020-06-15~2020-06-21', '2020-06-22~2020-06-28',
              '2020-06-29~2020-07-05', '2020-07-06~2020-07-12', '2020-07-13~2020-07-19', '2020-07-20~2020-07-26',
              '2020-07-27~2020-08-02', '2020-08-03~2020-08-09', '2020-08-10~2020-08-16', '2020-08-17~2020-08-23',
              '2020-08-24~2020-08-30', '2020-08-31~2020-09-06', '2020-09-07~2020-09-13', '2020-09-14~2020-09-20',
              '2020-09-21~2020-09-27', '2020-09-28~2020-10-04', '2020-10-05~2020-10-11', '2020-10-12~2020-10-18',
              '2020-10-19~2020-10-25', '2020-10-26~2020-11-01', '2020-11-02~2020-11-08', '2020-11-09~2020-11-15',
              '2020-11-16~2020-11-22', '2020-11-23~2020-11-29', '2020-11-30~2020-12-06', '2020-12-07~2020-12-13',
              '2020-12-14~2020-12-20', '2020-12-21~2020-12-27', '2020-12-28~2021-01-03', '2021-01-04~2021-01-10',
              '2021-01-11~2021-01-17', '2021-01-18~2021-01-24', '2021-01-25~2021-01-31', '2021-02-01~2021-02-07',
              '2021-02-08~2021-02-14', '2021-02-15~2021-02-21', '2021-02-22~2021-02-28', '2021-03-01~2021-03-07',
              '2021-03-08~2021-03-14', '2021-03-15~2021-03-21', '2021-03-22~2021-03-28', '2021-03-29~2021-04-04',
              '2021-04-05~2021-04-11', '2021-04-12~2021-04-18', '2021-04-19~2021-04-25', '2021-04-26~2021-05-02',
              '2021-05-03~2021-05-09', '2021-05-10~2021-05-16', '2021-05-17~2021-05-23', '2021-05-24~2021-05-30',
              '2021-05-31~2021-06-06']
    field4 = ['2020-23', '2020-24', '2020-25', '2020-26', '2020-27', '2020-28', '2020-29', '2020-30', '2020-31',
              '2020-32', '2020-33', '2020-34', '2020-35', '2020-36', '2020-37', '2020-38', '2020-39', '2020-40',
              '2020-41', '2020-42', '2020-43', '2020-44', '2020-45', '2020-46', '2020-47', '2020-48', '2020-49',
              '2020-50', '2020-51', '2020-52', '2020-53', '2021-1', '2021-2', '2021-3', '2021-4', '2021-5', '2021-6',
              '2021-7', '2021-8', '2021-9', '2021-10', '2021-11', '2021-12', '2021-13', '2021-14', '2021-15', '2021-16',
              '2021-17', '2021-18', '2021-19', '2021-20', '2021-21', '2021-22']
    result = []


def reader():
    # 读取xlsx
    wb = load_workbook(Config.base)
    sheet = wb.get_sheet_by_name("Sheet1")
    wb2 = Workbook()
    wresulSheet = wb2.active  # 默认选用当前表
    wresulSheet.title = '统计数据'  # 设定sheet的名字
    # 插入表头
    wresulSheet.append(Result.field1)
    print(len(Result.field1))
    print(len(Result.field2))
    # 按行读取
    # minrow = sheet.min_row  # 最小行
    # maxrow = sheet.max_row  # 最大行
    # mincol = sheet.min_column  # 最小列
    # maxcol = sheet.max_column  # 最大列
    for i in range(2, 96):
        Result.result = []
        for j in range(1, 4):
            print(sheet.cell(i, j).value)
            Result.result.append(sheet.cell(i, j).value)
        # 添加参数
        Result.result = Result.result + Result.field2
        # print(Result.result)
        Result.result.append("")
        Result.result.append("")
        Result.result.append("")
        # 添加周日期和测点数据
        for j,value in enumerate(Result.field4):
            Result.result[len(Result.result) - 3: len(Result.result) + 1] = []
            Result.result.append(value)
            # 添加随机数
            Result.result.append(random.randint(1700, 2100))
            # 添加时间范围
            Result.result.append(Result.field3[j])
            # 插入表格数据
            print(Result.result)
            wresulSheet.append(Result.result)
    wb2.save(Config.result)


if __name__ == "__main__":
    reader()
